app/views/carts/show.html.erb

<div class="container" style="margin-top: 5%" >
  <% if @current_cart.cart_items.empty? %>
---
SELECT  1 AS one FROM "cart_items" WHERE "cart_items"."cart_id" = $1 LIMIT $2  [["cart_id", 4], ["LIMIT", 1]]