app/controllers/application_controller.rb

	def current_cart
		@current_cart = Cart.find_by_id(session[:cart_id])
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create_cart
		unless current_cart
			@current_cart = Cart.new
			@current_cart.total=0
			@current_cart.total_price=0.0000
			@current_cart.save
---
INSERT INTO "carts" ("total", "created_at", "updated_at", "total_price") VALUES ($1, $2, $3, $4) RETURNING "id"  [["total", 0], ["created_at", "2019-02-15 14:04:04.005772"], ["updated_at", "2019-02-15 14:04:04.005772"], ["total_price", 0.0]]