app/controllers/cart_items_controller.rb

  def create
    @cart_product=CartItem.new(cart_item_params)
    product = Product.find_by_id(@cart_product.product_id)
    @cart_item=CartItem.find_by(product_id: product.id)
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."product_id" = $1 LIMIT $2  [["product_id", 2], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def destroy_cart_items
    @current_cart.cart_items.destroy_all
    @current_cart.destroy
---
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 4]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 1]]

  def edit
 		@cart_item=CartItem.find(params[:id])
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1  [["cart_id", 4]]