app/controllers/carts_controller.rb

	def show
		@cart_items=CartItem.joins(:cart,:product).where(:cart=>params[:id])
---
SELECT "cart_items".* FROM "cart_items" INNER JOIN "carts" ON "carts"."id" = "cart_items"."cart_id" INNER JOIN "products" ON "products"."id" = "cart_items"."product_id" WHERE "cart_items"."cart_id" = $1  [["cart_id", 4]]