app/controllers/categories_controller.rb

	def show
		@category=Category.find(params[:id])
		@products=Product.joins(:category).where(:status=>'published').where(:category=>params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" INNER JOIN "categories" ON "categories"."id" = "products"."category_id" WHERE "products"."status" = $1 AND "products"."category_id" = $2  [["status", 1], ["category_id", 1]]