app/controllers/orders_controller.rb

  def show
  	@order=Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def add_order_items

	    if @current_cart.cart_items.empty?
	    	redirect_to cart_path(@current_cart) ,:notice=>"Cart is empty"
	    elsif @current_cart.total_price.to_f >= 500.0
		    @order=Order.create(user_id:current_user.id,total_amount:0,quantity:0)
		    @current_cart.cart_items.each do |o|
			  	if o.product.stock>=o.quantity
			  		OrderItem.create(product_id: o.product_id,order_id:@order.id,quantity: o.quantity,amount:o.amount)
			  		@order.total_amount += o.amount
			  		@order.quantity += o.quantity.to_i
			  		product=Product.find(o.product_id)
			  		product.stock-=o.quantity.to_f
			  		if product.discount>0.0
			  			if product.discount_sell.nil?
			  				product.discount_sell=0
			  			end
			  			product.discount_sell+=o.quantity
			  		else
			  			if product.sell.nil?
			  				product.sell=0
			  			end
			  			product.sell+=o.quantity
			  		end
			  		product.save
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1  [["cart_id", 5]]
SELECT  1 AS one FROM "cart_items" WHERE "cart_items"."cart_id" = $1 LIMIT $2  [["cart_id", 5], ["LIMIT", 1]]
INSERT INTO "orders" ("user_id", "created_at", "updated_at", "quantity") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 4], ["created_at", "2019-02-16 15:39:24.856282"], ["updated_at", "2019-02-16 15:39:24.856282"], ["quantity", 0]]
INSERT INTO "order_items" ("order_id", "product_id", "quantity", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["order_id", 1], ["product_id", 2], ["quantity", 3], ["amount", 13388.76], ["created_at", "2019-02-16 15:39:24.874977"], ["updated_at", "2019-02-16 15:39:24.874977"]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "products" SET "stock" = $1, "discount_sell" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["stock", 117.0], ["discount_sell", 3], ["updated_at", "2019-02-16 15:39:24.889145"], ["id", 2]]

			  		end
			  	end
		    end
			if @order.save
			 	@current_cart.cart_items.destroy_all
---
UPDATE "orders" SET "total_amount" = $1, "updated_at" = $2, "quantity" = $3 WHERE "orders"."id" = $4  [["total_amount", 17153.760000000002], ["updated_at", "2019-02-16 15:39:24.917887"], ["quantity", 6], ["id", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 3]]
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 5]]