app/controllers/products_controller.rb

	def index
		@products=Product.search(params[:search])
		@categories=Category.all
---
SELECT "categories".* FROM "categories"

	def show
		@product=Product.find(params[:id])
		@options=Option.joins(:product).where(:product=>(params[:id]))
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "options".* FROM "options" INNER JOIN "products" ON "products"."id" = "options"."product_id" WHERE "options"."product_id" = $1  [["product_id", 2]]