app/models/cart_item.rb

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."product_id" = $1 LIMIT $2  [["product_id", 2], ["LIMIT", 1]]
UPDATE "cart_items" SET "quantity" = $1, "amount" = $2, "updated_at" = $3 WHERE "cart_items"."id" = $4  [["quantity", 2], ["amount", 8925.84], ["updated_at", "2019-02-16 15:37:37.668054"], ["id", 3]]
UPDATE "carts" SET "total" = $1, "total_price" = $2, "updated_at" = $3 WHERE "carts"."id" = $4  [["total", 2], ["total_price", 9016.92], ["updated_at", "2019-02-16 15:37:37.679017"], ["id", 5]]
---
 def validate_product_to_add_in_cart(quant,cart_item,product,cart)
	 	if quant.nil? or quant <= 0.0
	    "Order Cannot Be Place On This Quantity"
	  else
	    if cart_item.present? && product.id==cart_item.product_id
	      if product.stock-product.cart_item.quantity<quant
	        "Product Quantity Should be  less then #{product.stock-product.cart_item.quantity.to_i}"
	      else
	        cart_item.quantity += quant
	        if product.discount<=0.0
	          cart_item.amount+=product.total.to_f*quant.to_f
	        else
	          cart_item.amount+=(product.total.to_f-product.discount_price(product))*quant.to_f
	        end
	        cart_item.save
	        if cart.total.nil?
	          cart.total=0
	        end
	        cart.total+=quant
	        cart.total_price+=product.total.to_f*quant.to_f
	        cart.save

INSERT INTO "cart_items" ("cart_id", "product_id", "quantity", "created_at", "updated_at", "amount") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cart_id", 4], ["product_id", 2], ["quantity", 1], ["created_at", "2019-02-16 15:36:47.238829"], ["updated_at", "2019-02-16 15:36:47.238829"], ["amount", 4462.92]]
---
	        else
	          amount=(product.total.to_f-product.discount_price(product))*quant.to_f
	        end
	        product.create_cart_item(product_id:product.id, cart_id: cart.id,quantity: quant,amount: amount)

UPDATE "carts" SET "total" = $1, "total_price" = $2, "updated_at" = $3 WHERE "carts"."id" = $4  [["total", 1], ["total_price", 4462.92], ["updated_at", "2019-02-16 15:36:47.251742"], ["id", 4]]
---
	          cart.total_price=0.0
	        end
	        cart.total_price+=amount
	        cart.save