app/models/product.rb

  def total_price(product)
    product.total=product.price
    product.total+=product.options.sum(&:price)
    product.save
---
SELECT "options".* FROM "options" WHERE "options"."product_id" = $1  [["product_id", 1]]
UPDATE "products" SET "total" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["total", 1255.0], ["updated_at", "2019-02-16 15:35:23.604620"], ["id", 1]]