app/views/products/_productshow.html.erb

            </p>
             <% if @product.cart_item.present? %>
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."product_id" = $1 LIMIT $2  [["product_id", 1], ["LIMIT", 1]]

              </p>
              <% if @product.cart_item.present? %>
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."product_id" = $1 LIMIT $2  [["product_id", 2], ["LIMIT", 1]]