app/views/products/index.html.erb

                  </h5>
                  <% if product.cart_item.present? %>
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."product_id" = $1 LIMIT $2  [["product_id", 1], ["LIMIT", 1]]