app/views/products/index.html.erb

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."product_id" = $1 LIMIT $2  [["product_id", 1], ["LIMIT", 1]]
---
                  </h5>
                  <% if product.cart_item.present? %>

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."product_id" = $1 LIMIT $2  [["product_id", 2], ["LIMIT", 1]]
---
                  </h4>
                  <% if product.cart_item.present? %>